micropython/micropython/stmhal/cmsis/devinc/stm32f207xx.h
/*****************  Bit definition for SYSCFG_EXTICR1 register  ***************/                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
#define SYSCFG_EXTICR1_EXTI0            ((uint32_t)0x0000000F) /*!<EXTI 0 configuration */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            
#define SYSCFG_EXTICR1_EXTI1            ((uint32_t)0x000000F0) /*!<EXTI 1 configuration */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            
#define SYSCFG_EXTICR1_EXTI2            ((uint32_t)0x00000F00) /*!<EXTI 2 configuration */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            
#define SYSCFG_EXTICR1_EXTI3            ((uint32_t)0x0000F000) /*!<EXTI 3 configuration */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            
/**                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               
  * @brief   EXTI0 configuration                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
  */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              
#define SYSCFG_EXTICR1_EXTI0_PA         ((uint32_t)0x00000000) /*!<PA[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PB         ((uint32_t)0x00000001) /*!<PB[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PC         ((uint32_t)0x00000002) /*!<PC[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PD         ((uint32_t)0x00000003) /*!<PD[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PE         ((uint32_t)0x00000004) /*!<PE[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PF         ((uint32_t)0x00000005) /*!<PF[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PG         ((uint32_t)0x00000006) /*!<PG[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PH         ((uint32_t)0x00000007) /*!<PH[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI0_PI         ((uint32_t)0x00000008) /*!<PI[0] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
/**                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               
  * @brief   EXTI1 configuration                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
  */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              
#define SYSCFG_EXTICR1_EXTI1_PA         ((uint32_t)0x00000000) /*!<PA[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI1_PB         ((uint32_t)0x00000010) /*!<PB[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI1_PC         ((uint32_t)0x00000020) /*!<PC[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
