micropython/micropython/stmhal/cmsis/devinc/stm32f207xx.h
#define SYSCFG_EXTICR1_EXTI1_PD         ((uint32_t)0x00000030) /*!<PD[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI1_PE         ((uint32_t)0x00000040) /*!<PE[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI1_PF         ((uint32_t)0x00000050) /*!<PF[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI1_PG         ((uint32_t)0x00000060) /*!<PG[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI1_PH         ((uint32_t)0x00000070) /*!<PH[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI1_PI         ((uint32_t)0x00000080) /*!<PI[1] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
/**                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               
  * @brief   EXTI2 configuration                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
  */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              
#define SYSCFG_EXTICR1_EXTI2_PA         ((uint32_t)0x00000000) /*!<PA[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PB         ((uint32_t)0x00000100) /*!<PB[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PC         ((uint32_t)0x00000200) /*!<PC[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PD         ((uint32_t)0x00000300) /*!<PD[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PE         ((uint32_t)0x00000400) /*!<PE[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PF         ((uint32_t)0x00000500) /*!<PF[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PG         ((uint32_t)0x00000600) /*!<PG[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PH         ((uint32_t)0x00000700) /*!<PH[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI2_PI         ((uint32_t)0x00000800) /*!<PI[2] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
/**                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               
  * @brief   EXTI3 configuration                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
  */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              
#define SYSCFG_EXTICR1_EXTI3_PA         ((uint32_t)0x00000000) /*!<PA[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI3_PB         ((uint32_t)0x00001000) /*!<PB[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
