micropython/micropython/stmhal/cmsis/devinc/stm32f207xx.h
#define SYSCFG_EXTICR1_EXTI3_PC         ((uint32_t)0x00002000) /*!<PC[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI3_PD         ((uint32_t)0x00003000) /*!<PD[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI3_PE         ((uint32_t)0x00004000) /*!<PE[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI3_PF         ((uint32_t)0x00005000) /*!<PF[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI3_PG         ((uint32_t)0x00006000) /*!<PG[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI3_PH         ((uint32_t)0x00007000) /*!<PH[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
#define SYSCFG_EXTICR1_EXTI3_PI         ((uint32_t)0x00008000) /*!<PI[3] pin */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
